
/*  
Марж - излишък; разлика между две величини/стойности;
Във финансите маржът на печалба е разликата между приходите от продажбите и разходите за производство на дадена стока.
!!! Чистата печалба е стойност (абсолютна), която ни показва колко пари остават на фирмата след всички разходи и данъци.
Докато маржът е процент (относителна стойност), и в случая маржът на печалба ни показва каква ЧАСТ от приходите е печалба.

Защо БРУТЕН марж?

Брутният марж включва само преките разходи - разходи за суровини, труд, логистика и други разходи, свързани с производството на стоката.
При нетния марж вече ще включим и непреки разходи - административни разходи, маркетинг, данъци и други.

С други думи, брутният марж ни показва колко ефективно една компания произвежда и продава своите продукти.
Напомняне: ефективността беше постигане на ефекта без оглед как се ползват ресурсите.
Докато ефикасността беше постигане на резултат с минимални ресурси.

Та, брутният марж ни показва ефективността на компанията. Целта на компанията е? Печалба.
С други думи брутният марж ни казва, генерира ли средства компанията?
*/

/*
Да се изчисли Брутен марж (Gross Margin) и да се провери логически дали целевият марж печалба е достигнат.
    
Брутен марж = (Продажби − Разходи) / Продажби​
   
Логическа проверка: Брутният марж > 0.30
*/
public class GrossMargin
{
    public static void Main(string[] args)
    {

        // Извеждане на кирилица в конзолата
        Console.OutputEncoding = System.Text.Encoding.UTF8;

        double sales = 15000.00; // Общи продажби
        double costOfGoods = 9000.00; // Разходи за стоки
        
        double grossMargin = (sales - costOfGoods) / sales; 
        
        const double TARGET_MARGIN = 0.30; // Целеви марж от 30%
        bool isTargetReached = grossMargin > TARGET_MARGIN; 

        Console.WriteLine($"Брутен марж (като десетична дроб): {grossMargin:F2}");
        // Както в Excel и тук можем да форматираме. С F2 показваме 2 цифри след десетичната запетая.
        // F - Fixed-point
        // P - Percentage
        // С $ казваме, че можем да включим стойности директно в низа/стринга/изречението
        
        Console.WriteLine($"Целевият марж от {TARGET_MARGIN:P0} достигнат ли е? " + isTargetReached); // True
    }
}